export interface CheckItemData {
  t: string
  debug?: true
  c?: CheckItemData[]
}

export default [
  {
    t: ``,
    c: [
      { t: `تهیه برگ شروع عملیات ساختمانی` },
      { t: `انطباق بر و کف زمین با طرح معماری مصوب با همراهی مهندس ناظر سازه` },
      { t: `کنترل شیب های طولی و عرضی زمین با طرح معماری مصوب` },
      { t: `کنترل ابعاد و عمق خاکبرداری با هماهنگی مهندس ناظر سازه` },
      {
        t: `آیا دستورات و توصیه های لازم به مالک و مجری درخصوص رعایت اصول ایمنی زیر ابلاغ شده است.`,
        c: [
          { t: `اجرای حفاظ در اطراف کارگاه و محلهای مشرف به پرتگاه` },
          { t: `تعبیه جعبه کمکهای اولیه در کارگاه` },
          { t: `تأمین کمربند ایمنی کلاه ایمنی چکمه پوتین و ... برای کارگران` },
          { t: `در صورت وجود خاکبرداری در گود سازه نگهبان وجود دارد` },
        ],
      },
    ],
  },
  {
    t: ``,
    c: [
      {
        t: `کنترل ارتفاع پی و محل قرارگیری ستونها با نقشه های معماری و سازه و صحت اجرای آن`,
      },
      {
        t: `کنترل محل راه پله و چاهک آسانسور با هماهنگی نقشه های سازه و معماری`,
      },
      {
        t: `کنترل کد ارتفاعی اولین پوشش زیر پوشش های بتنی یا نبشی های تکیه گاهی در سازه های فولادی`,
      },
      {
        t: `کنترل محل دیوارهای باربر و جداکننده کلیه دیوارهای داخلی و خارجی ضخامت و نوع مصالح آنها با طرح مصوب معماری`,
      },
      { t: `عایقکاری دیوارهای زیرزمین و کرسی چینی ها` },
      {
        t: `آیا موارد حفاظت و ایمنی کارگاه راه پله ها، چاه آسانسور، کنسول و...) به مالک و مجری ابلاغ شده است.`,
      },
    ],
  },
  {
    t: ``,
    c: [
      {
        t: `کنترل محل قرارگیری ستونها با نقشه های معماری و سازه و صحت اجرای آن`,
      },
      {
        t: `کنترل محل راه پله و چاهک آسانسور با هماهنگی نقشه های سازه و معماری`,
      },
      {
        t: `کنترل کد ارتفاعی پوشش زیر پوشش های بتنی یا نبشی های تکیه گاهی در سازه های فولادی`,
      },
      {
        t: `کنترل محل دیوارهای باربر و جداکننده کلیه دیوارهای داخلی و خارجی) ضخامت و نوع مصالح آنها با طرح مصوب معماری`,
      },
      { t: `عایقکاری دیوارها و کرسی چینی ها` },
      {
        t: `آیا موارد حفاظت و ایمنی کارگاه راه پله ها، چاه آسانسور، کنسول و ...) به مالک و مجری ابلاغ شده است.`,
      },
    ],
  },
] satisfies CheckItemData[]
