export default function Home() {
  return (
    <div className="hero bg-base-200">
      <div className="hero-content prose flex-col lg:flex-row">
        <div>
          <img src="/arch-eng.jpg" className="w-full rounded-lg shadow-2xl" />
        </div>
        <div>
          <h1 className="text-5xl font-bold">نرم افزار مهندسی مهدیار</h1>
          <p className="py-6">
            با کمال خوشحالی به اطلاع می‌رسانیم که نرم‌افزار جدید و پیشرفته
            دستیار مهندسی ما به‌زودی منتشر خواهد شد! این نرم‌افزار با هدف تسهیل
            فرآیندهای مهندسی و افزایش بهره‌وری در پروژه‌های مختلف طراحی شده است.
          </p>
          <h2>ویژگی‌های کلیدی نرم‌افزار:</h2>
          <p className="py-6">
            رابط کاربری جذاب و کاربرپسند: طراحی مدرن و ساده که به شما امکان
            می‌دهد به راحتی به ابزارها و امکانات دسترسی پیدا کنید. تحلیل و
            شبیه‌سازی پیشرفته: ابزارهای قدرتمند برای تحلیل داده‌ها و شبیه‌سازی
            سناریوهای مختلف. مدیریت پروژه: قابلیت‌های جامع برای برنامه‌ریزی،
            پیگیری و مدیریت پروژه‌ها به‌صورت کارآمد. پشتیبانی از چندین فرمت:
            امکان کار با انواع فرمت‌های فایل مهندسی و تبادل اطلاعات به‌راحتی.
            آموزش و پشتیبانی: منابع آموزشی و پشتیبانی ۲۴ ساعته برای کمک به شما
            در هر مرحله. ما به شما این اطمینان را می‌دهیم که این نرم‌افزار به
            شما کمک خواهد کرد تا پروژه‌های خود را با دقت و سرعت بیشتری به انجام
            برسانید.
          </p>
          <p className="py-6">
            از حمایت و اعتماد شما سپاسگزاریم و منتظر نظرات و پیشنهادات شما
          </p>
          <p className="py-6">هستیم! با احترام، خط سوم</p>
        </div>
      </div>
    </div>
  )
}
